packages/fxa-auth-server/test/local/payments/fixtures/subscription2.json

{
  "id": "sub_GAt1vgMqOSr5hT",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1573695337,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "collection_method": "charge_automatically",
  "created": 1573695337,
  "current_period_end": 1576287337,
  "current_period_start": 1573695337,
  "customer": "cus_G8ByGeO3M4cBPW",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": null,
  "invoice_customer_balance_settings": {
    "consume_applied_balance_on_void": true
  },
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_GAt1kPzMVRl7cs",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1573695338,
        "metadata": {},
        "plan": {
          "id": "plan_G93mMKnIFCjZek",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 999,
          "amount_decimal": "999",
          "billing_scheme": "per_unit",
          "created": 1573274099,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": "FPN Advanced",
          "product": "prod_G93mdk6bGPJ7wy",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_GAt1vgMqOSr5hT",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_GAt1vgMqOSr5hT"
  },
  "latest_invoice": "in_1FeXFGJNcmPzuWtR3EUd2zw7",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "plan": {
    "id": "plan_G93mMKnIFCjZek",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 999,
    "amount_decimal": "999",
    "billing_scheme": "per_unit",
    "created": 1573274099,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": "FPN Advanced",
    "product": "prod_G93mdk6bGPJ7wy",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1573695676,
  "start_date": 1573695337,
  "status": "active",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}
